namespace ConsoleApp1
{
    /*
     Задание 1
Создайте анонимный метод для получения RGB значения для цвета радуги. Цвет радуги передаётся в качестве
параметра. Напишите код для тестирования работы метода.

Задание 2
Создайте класс рюкзак. Характеристики рюкзака:
■ Цвет рюкзака;
■ Фирма производитель;
■ Ткань рюкзака;
■ Вес рюкзака;
■ Объём рюкзака;
■ Содержимое рюкзака (список объектов, у каждого
объекта кроме названия нужно учитывать занимаемый объём).
Создайте методы для заполнения характеристик.
Создайте событие для добавления объекта в рюкзак.
Реализуйте анонимный метод в качестве обработчика
события добавления объекта. Если при попытке добавления может быть превышен объём рюкзака, нужно
генерировать исключение.

Задание 3
Создайте лямбда-выражение для подсчёта количества чисел в массиве, кратных семи. Напишите код для
тестирования работы лямбды.

Задание 4
Создайте лямбда-выражение для подсчёта количества положительных чисел в массиве. Напишите код для
тестирования работы лямбды.

Задание 5
Создайте лямбда-выражение для отображения уникальных отрицательных чисел в массиве. Напишите код
для тестирования работы лямбды.

Задание 6
Создайте лямбда-выражение для проверки есть ли в
тексте заданное слово. Напишите код для тестирования
работы лямбды.
 */
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
